import pytest
from task_3 import course_order

@pytest.mark.parametrize(
    "courses, mentors, durations, expected",
    [
        (
            ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля", "Frontend-разработчик с нуля"],
            [
                ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев", "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский", "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов", "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
                ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский", "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
                ["Евгений Шмаргунов","Олег Булыгин","Дмитрий Демидов","Кирилл Табельский","Александр Ульянцев","Александр Бардин","Александр Иванов","Антон Солонилин","Максим Филипенко","Елена Никитина"],
                ["Владимир Чебукин","Эдгар Нуруллин","Евгений Шек","Валерий Хаслер","Татьяна Тен","Александр Фитискин","Александр Шлейко","Алена Батицкая","Александр Беспоясов","Денис Ежков"]
            ],
            [14, 20, 12, 20],
            (False, [2, 0, 1, 3], [2, 3, 1, 0])
        ),
        (
            ["Курс 1", "Курс 2"],
            [["Ментор 1"], ["Ментор 2"]],
            [5, 10],
            (True, [0, 1], [0, 1])
        ),
        (
            ["Курс 1"],
            [["Ментор 1"]],
            [5],
            (True, [0], [0])
        ),
    ],
)
def test_course_order(courses, mentors, durations, expected):
    assert course_order(courses, mentors, durations) == expected